// 消息
export default [
	{
		url: '/api/getUserNotice',
		method: 'get',
		statusCode: 200,
		response: () => {
			return {
				code: 200,
				message: '获取成功!',
				data: {
					notice: [
						{
							title: '刘经理通过了你的请假申请',
							date: '2023-05-06 18:00:00',
						},
						{
							title: '刘经理通过了你的请假申请',
							date: '2023-05-06 18:00:00',
						},
						{
							title: '刘经理通过了你的请假申请',
							date: '2023-05-06 18:00:00',
						},
						{
							title: '刘经理通过了你的请假申请',
							date: '2023-05-06 18:00:00',
						},
						{
							title: '刘经理通过了你的请假申请',
							date: '2023-05-06 18:00:00',
						},
						{
							title: '刘经理通过了你的请假申请',
							date: '2023-05-06 18:00:00',
						},
						{
							title: '刘经理通过了你的请假申请',
							date: '2023-05-06 18:00:00',
						},
						{
							title: '刘经理通过了你的请假申请',
							date: '2023-05-06 18:00:00',
						},
					],
					privateMessage: [
						{
							title: '刘总点赞了你的日志！',
							content: '写的不错继续努力!',
							date: '2023-05-06 18:00:00',
						},
						{
							title: '刘总点赞了你的日志！',
							content: '写的不错继续努力!',
							date: '2023-05-06 18:00:00',
						},
						{
							title: '刘总点赞了你的日志！',
							content: '写的不错继续努力!',
							date: '2023-05-06 18:00:00',
						},
						{
							title: '刘总点赞了你的日志！',
							content: '写的不错继续努力!',
							date: '2023-05-06 18:00:00',
						},
						{
							title: '刘总点赞了你的日志！',
							content: '写的不错继续努力!',
							date: '2023-05-06 18:00:00',
						},

						{
							title: '刘总点赞了你的日志！',
							content: '写的不错继续努力!',
							date: '2023-05-06 18:00:00',
						},
					],
					todo: [
						{
							title: '第三方bug紧急修复',
							type: '0',
							date: '2023-05-06 18:00:00',
						},
						{
							title: '高数考试',
							type: '1',
							date: '2023-05-06 18:00:00',
						},
						{
							title: '专升本考试',
							type: '2',
							date: '2023-05-06 18:00:00',
						},
					],
				},
			}
		},
	},
]
